<a name="start"></a>
1. [Оформление кода](#anchor1).
2. [Выделение слов в тексте ](#anchor2).
3. [Ссылки](#anchor3).
4. [Якорь](#anchor4).
5. [Заголовки](#anchor5).
6. [Выделения](#anchor6).
7. [Оформление таблички](#anchor7).




<a name="anchor1"></a>
# Оформление кода 
```
```python (или любое имя ЯП)
s = "Да будет выделен синтаксис"
if s == True:
     for i in range(len(s)):
          print(s, i)
```
> Пример использования

```python
s = "Да будет выделен синтаксис"
if s == True:
     for i in range(len(s)):
          print(s, i)
```
<a name="anchor2"></a>
# Выделение слов в тексте 
```
Слово `выделено` пишется `выделено` =).
```
> Пример использования:

Слово `выделено` пишется `выделено` =).

<a name="anchor3"></a>
# Ссылки 
```
Сталин был первым поисковиком,
ты ему слово, а он тебе [ссылку](https://www.google.com)

Это не я не неправильный,
это у Вас [Дзен](https://zen.yandex.ru/) неправильный
```
> Пример использования:

Сталин был первым поисковиком,
ты ему слово, а он тебе [ссылку](https://www.google.com)

Это не я не неправильный,
это у Вас [Дзен](https://zen.yandex.ru/) неправильный

<a name="anchor4"></a>
# Якорь (ссылка по документу)
```
- куда хотим переходить [место перехода](#anchor1).

- указываем место перехода <a name="anchor1"></a>
```
> Пример использования

<a name="anchor101"></a>
[место перехода](#anchor101).


<a name="anchor5"></a>
# Заголовки
```
#-кол-во раз, такой и заголовок
# H1 
## H2
### H3
#### H4
##### H5
###### H6
Alt-H1 
======
Alt-H2
------
```
>Пример исполнения:
# H1 
## H2
### H3
#### H4
##### H5
###### H6
Alt-H1 
======
Alt-H2
------

<a name="anchor6"></a>
# Выделения 
```
Выделение италиком *что написано* или _что написано_.

Сделать жирненьким **что написано** или __что написано__.

Совмещение (жирненький италик) **что написано и _что написано_**.

Зачеркнутое ~~что написано~~
```
>Пример исполнения:

Выделение италиком *что написано* или _что написано_.

Сделать жирненьким **что написано** или __что написано__.

Совмещение (жирненький италик) **что написано и _что написано_**.

Зачеркнутое ~~что написано~~

<a name="anchor7"></a>
# Оформление таблички 
```

| имя колонки   | имя колонки   | имя колонки  |
| ------------- |:-------------:| ------------:|
| значение      | значение      | значение     |

Боковые пайпы не обязательны (|), как и форматирование

имя колонки | имя колонки | имя колонки
--- | --- | ---
*значение италиком* | `значение заполнено` | **значение жирным**
| значение      | значение      | значение     |
```
> Пример исполнения:

| имя колонки   | имя колонки   | имя колонки  |
| ------------- |:-------------:| ------------:|
| значение      | значение      | значение     |

Боковые пайпы не обязательны (|), как и форматирование

имя колонки | имя колонки | имя колонки
--- | --- | ---
*значение италиком* | `значение серым` | **значение жирным**
| значение      | значение      | значение     |



[К началу документа](#start)
